/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@ %2$[Any Date]@";
"%@ %[Today]@" = "%1$@ %2$[Today]@";
"%@ %[Since Yesterday]@" = "%1$@ %2$[Since Yesterday]@";
"%@ %[This week]@" = "%1$@ %2$[This week]@";
"%@ %[Within Last 2 weeks]@" = "%1$@ %2$[Within Last 2 weeks]@";
"%@ %[This month]@" = "%1$@ %2$[This month]@";
"%@ %[Within Last 2 months]@" = "%1$@ %2$[Within Last 2 months]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@ %2$[Any]@";
"%@ %[Yes]@" = "%1$@ %2$[Yes]@";
"%@ %[No]@" = "%1$@ %2$[No]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@ %2$[Contains]@ %3$@";
"%@ %[Begins With]@ %@" = "%1$@ %2$[Begins With]@ %3$@";
"%@ %[Ends With]@ %@" = "%1$@ %2$[Ends With]@ %3$@";
"%@ %[Is]@ %@" = "%1$@ %2$[Is]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@ %2$[Exactly]@ %3$@";
"%@ %[Before]@ %@" = "%1$@ %2$[Before]@ %3$@";
"%@ %[After]@ %@" = "%1$@ %2$[After]@ %3$@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@ %2$[Greater than]@ %3$@";
"%@ %[Less than]@ %@" = "%1$@ %2$[Less than]@ %3$@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@ %2$[Within Last]@ %3$@ %4$[Days]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@ %2$[Within Last]@ %3$@ %4$[Weeks]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@ %2$[Within Last]@ %3$@ %4$[Months]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@ %2$[Within Last]@ %3$@ %4$[Years]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[Color Space]@ %2$[Any Color Space]@";
"%[Color Space]@ %[RGB]@" = "%1$[Color Space]@ %2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[Color Space]@ %2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[Color Space]@ %2$[Grayscale]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[Contents]@ contain %2$@";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duration]@ %2$[Greater than]@ %3$@ %4$[min]@ %5$@ %6$[sec]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[Duration]@ %2$[Less than]@ %3$@ %4$[min]@ %5$@ %6$[sec]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[Keywords]@ %2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[Keywords]@ contain %2$@";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[Kind]@ is %2$[Any]@";
"%[Kind]@ is %[Images]@" = "%1$[Kind]@ is %2$[Images]@";
"%[Kind]@ is %[Text]@" = "%1$[Kind]@ is %2$[Text]@";
"%[Kind]@ is %[PDF]@" = "%1$[Kind]@ is %2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[Kind]@ is %2$[Movies]@";
"%[Kind]@ is %[Music]@" = "%1$[Kind]@ is %2$[Music]@";
"%[Kind]@ is %[Documents]@" = "%1$[Kind]@ is %2$[Documents]@";
"%[Kind]@ is %[Presentations]@" = "%1$[Kind]@ is %2$[Presentations]@";
"%[Kind]@ is %[Folders]@" = "%1$[Kind]@ is %2$[Folders]@";
"%[Kind]@ is %[Applications]@" = "%1$[Kind]@ is %2$[Applications]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[Kind]@ is %2$[Others...]@ %3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[Label]@ is %2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[Last Opened]@ %2$[Any Date]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[Last Modified]@ %2$[Any Date]@";
"%[Created]@ %[Any Date]@" = "%1$[Created]@ %2$[Any Date]@";
"%[Last Opened]@ %[Today]@" = "%1$[Last Opened]@ %2$[Today]@";
"%[Last Modified]@ %[Today]@" = "%1$[Last Modified]@ %2$[Today]@";
"%[Created]@ %[Today]@" = "%1$[Created]@ %2$[Today]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[Last Opened]@ %2$[Since Yesterday]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[Last Modified]@ %2$[Since Yesterday]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[Created]@ %2$[Since Yesterday]@";
"%[Last Opened]@ %[This week]@" = "%1$[Last Opened]@ %2$[This week]@";
"%[Last Modified]@ %[This week]@" = "%1$[Last Modified]@ %2$[This week]@";
"%[Created]@ %[This week]@" = "%1$[Created]@ %2$[This week]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[Last Opened]@ %2$[Within Last 2 weeks]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[Last Modified]@ %2$[Within Last 2 weeks]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[Created]@ %2$[Within Last 2 weeks]@";
"%[Last Opened]@ %[This month]@" = "%1$[Last Opened]@ %2$[This month]@";
"%[Last Modified]@ %[This month]@" = "%1$[Last Modified]@ %2$[This month]@";
"%[Created]@ %[This month]@" = "%1$[Created]@ %2$[This month]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[Last Opened]@ %2$[Within Last 2 months]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[Last Modified]@ %2$[Within Last 2 months]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[Created]@ %2$[Within Last 2 months]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[Last Opened]@ %2$[Exactly]@ %3$@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[Last Modified]@ %2$[Exactly]@ %3$@";
"%[Created]@ %[Exactly]@ %@" = "%1$[Created]@ %2$[Exactly]@ %3$@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[Last Opened]@ %2$[Before]@ %3$@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[Last Modified]@ %2$[Before]@ %3$@";
"%[Created]@ %[Before]@ %@" = "%1$[Created]@ %2$[Before]@ %3$@";
"%[Last Opened]@ %[After]@ %@" = "%1$[Last Opened]@ %2$[After]@ %3$@";
"%[Last Modified]@ %[After]@ %@" = "%1$[Last Modified]@ %2$[After]@ %3$@";
"%[Created]@ %[After]@ %@" = "%1$[Created]@ %2$[After]@ %3$@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[Last Opened]@ %2$[Within Last]@ %3$@ %4$[Days]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[Last Modified]@ %2$[Within Last]@ %3$@ %4$[Days]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[Created]@ %2$[Within Last]@ %3$@ %4$[Days]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Last Opened]@ %2$[Within Last]@ %3$@ %4$[Weeks]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Last Modified]@ %2$[Within Last]@ %3$@ %4$[Weeks]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[Created]@ %2$[Within Last]@ %3$@ %4$[Weeks]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[Last Opened]@ %2$[Within Last]@ %3$@ %4$[Months]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[Last Modified]@ %2$[Within Last]@ %3$@ %4$[Months]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[Created]@ %2$[Within Last]@ %3$@ %4$[Months]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[Last Opened]@ %2$[Within Last]@ %3$@ %4$[Years]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[Last Modified]@ %2$[Within Last]@ %3$@ %4$[Years]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[Created]@ %2$[Within Last]@ %3$@ %4$[Years]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[Musical genre]@ %2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[Name Extension]@ %2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[Name]@ %2$[Contains]@ %3$@";
"%[Name]@ %[Begins With]@ %@" = "%1$[Name]@ %2$[Begins With]@ %3$@";
"%[Name]@ %[Ends With]@ %@" = "%1$[Name]@ %2$[Ends With]@ %3$@";
"%[Name]@ %[Is]@ %@" = "%1$[Name]@ %2$[Is]@ %3$@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[Orientation]@ %2$[Any Orientation]@";
"%[Orientation]@ %[Landscape]@" = "%1$[Orientation]@ %2$[Landscape]@";
"%[Orientation]@ %[Portrait]@" = "%1$[Orientation]@ %2$[Portrait]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[Other...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[Raw query]@ %2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%1$[Search for]@ %2$@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[Size]@ %2$[Greater than]@ %3$@ %4$[KB]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[Size]@ %2$[Less than]@ %3$@ %4$[KB]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[Size]@ %2$[Greater than]@ %3$@ %4$[MB]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[Size]@ %2$[Less than]@ %3$@ %4$[MB]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[Size]@ %2$[Greater than]@ %3$@ %4$[GB]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[Size]@ %2$[Less than]@ %3$@ %4$[GB]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[Visibility]@ %2$[Visible or Invisible]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[Visibility]@ %2$[Visible Items]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[Visibility]@ %2$[Invisible Items]@";

